from userbot import iqthon

from ..core.managers import edit_or_reply

@iqthon.on(admin_cmd(pattern="الاوامر(?: |$)(.*)"))    
async def iq(event):
    await edit_or_reply(event, "https://t.me/M4_STORY/3439")
@iqthon.on(admin_cmd(pattern="اعاده تشغيل(?: |$)(.*)"))    
async def iq(event):
    await edit_or_reply(event, " ⌔︙ عـذرًا، الأمر لقد تغير قم بأرسال فقط  ⬅️ `.تحديث` " "⌔︙ عـذرًا، الأمر لقد تغير قم بأرسال فقط  ⬅️ `.تحديث` ")
@iqthon.on(admin_cmd(pattern="اعاده تشغيل(?: |$)(.*)"))    
async def iq(event):
    await edit_or_reply(event, " ⌔︙ عـذرًا، الأمر لقد تغير قم بأرسال فقط  ⬅️ `.تحديث` " "⌔︙ عـذرًا، الأمر لقد تغير قم بأرسال فقط  ⬅️ `.تحديث` ")
@iqthon.on(admin_cmd(pattern="م1(?: |$)(.*)"))    
async def iq(event):
    await edit_or_reply(event, "**🚹  ⦑   اوامر السورس  ⤮.م1⤪   ⦒  :**\n\n⑴ ⦙ `.السورس` \n**✐  : يضهر لك معلومات السورس ومدة تنصيبك❝**\n⤪⟿⟿⟿⟿⟿⟿⟿⟿⟿⟿⟿⤮ \n⑵ ⦙ `.رابط التنصيب` \n**✐  : سوف يعطيك رابط التنصيب ❝** \n ⤪⟿⟿⟿⟿⟿⟿⟿⟿⟿⟿⟿⤮  \n⑶ ⦙ `.حساب كيثاب + اسم الحساب` \n**✐  : ينطيك معلومات الحساب وسورساته بموقع جيت هوب ❝** \n ⤪⟿⟿⟿⟿⟿⟿⟿⟿⟿⟿⟿⤮ \n⑷ ⦙ `.حذف جميع الملفات` \n**✐  : يحذف جميع ملفات تنصيبك ❝** \n ⤪⟿⟿⟿⟿⟿⟿⟿⟿⟿⟿⟿⤮ \n⑸ ⦙ `.المده` \n**✐  : يضهر لك مدة تشغيل بوت تليثون لديك ❝** \n⤪⟿⟿⟿⟿⟿⟿⟿⟿⟿⟿⟿⤮ \n⑹ ⦙ `.فارات تنصيبي` \n**✐  : يجلب لك جميع الفارات التي لديك وجميع معلومات تنصيبك في هيروكو ❝** \n ⤪⟿⟿⟿⟿⟿⟿⟿⟿⟿⟿⟿⤮ \n")    
@iqthon.on(admin_cmd(pattern="م2(?: |$)(.*)"))    
async def iq(event):
    await edit_or_reply(event, "**🚹  ⦑   اوامر التنزيلات والبحث الاغاني  ⤮.م3⤪   ⦒  :**\n \n⑴  ⦙ `.بحث صوت + اسم الاغنيه`\n✐ : سيحمل لك الاغنية صوت ايضا يمكنك وضع رابط الاغنيه بدل الاسم ❝ \n ⤪⟿⟿⟿⟿⟿⟿⟿⟿⟿⟿⟿⤮ \n ⑵  ⦙ `.بحث فيديو + اسم الاغنيه` \n✐ : سيحمل لك الاغنية  فيديو ايضا يمكنك وضع رابط الاغنيه بدل الاسم ❝\n ⤪⟿⟿⟿⟿⟿⟿⟿⟿⟿⟿⟿⤮ \n\n ⑶  ⦙ `.معلومات الاغنيه` \n✐ : الرد ع الاغنيه سيجلب لك معلوماتها واسم الفنان ❝\n⤪⟿⟿⟿⟿⟿⟿⟿⟿⟿⟿⟿⤮ \n \n⑷  ⦙ `.كوكل بحث + موضوع البحث`\n✐ : يجلب لك معلومات الموضوع من كوكل ❝\n⤪⟿⟿⟿⟿⟿⟿⟿⟿⟿⟿⟿⤮ \n⑸  ⦙ `.تخزين الصوت + الرد ع البصمه`\n✐ : تخزين الصوت من اجل استخدامه لوضع صوت في الفيديو ❝\n ⤪⟿⟿⟿⟿⟿⟿⟿⟿⟿⟿⟿⤮ \n⑹ ⦙ `.اضف الصوت + الرد ع الصوره او متحركه او فيديو`\n✐ : يتم اضافه الصوت الى الفيديو او المتحركه او الصوره ❝\n ⤪⟿⟿⟿⟿⟿⟿⟿⟿⟿⟿⟿⤮ \n⑺ ⦙ `.اسم الاغنيه + الرد ع الاغنيه`\n✐ : ييجلب لك اسم الاغنيه مدة البصمه 10 الى 5 ثواني ❝\n⑻ ⦙ `تيك توك + الرد ع رابط الفيديو✐ : يحمل فيديو تيك توك بدون العلامه المائيه ❝\n ⤪⟿⟿⟿⟿⟿⟿⟿⟿⟿⟿⟿⤮\n")
