from userbot import iqthon

from ..core.managers import edit_or_reply

plugin_category = "الأوامر"


@iqthon.iq_cmd(
    pattern="جميع الاوامر$",
    command=("جميع الاوامر", plugin_category),
    info={
        "header": "جميع الاوامر",
        "usage": "جميع الاوامر",
    },
)
async def _(event):
    "جميع الاوامر"
    await edit_or_reply(
        event,
        "• ⚜️ |  اوامر الادمن والمجموعه :    \n\n.مسح جميع الردود\n.مسح رد\n.جميع الردود\n.اضف رد\n.صورة\n.رفع مشرف\n.تك\n.طرد\n.تثبيت\n.الغاء التثبيت\n.الاحداث\n.حظر\n.الغاء حظر\n.كتم\n.الغاء كتم\n.الاوامر\n.جميع الاوامر\n.الايدي\n.بنك\n.ترحيب\n.مسح الترحيبات\n.الترحيبات\n.رساله الترحيب السابقه\n.السورس\n.انتحال\n.الغاء الانتحال\n\n• ⚜️ |  اوامر متحركات تسلية :  \n\n.بوسه\n.زرفه\n.بيبي\n.افكر\n.ضحك\n.ضايج\n.وقت\n.قلوب\n.رياضه\n.الارض\n.قمر\n.اقمار\n.قمور\n.فراشه\n.مكعبات\n.مطر\n.تحركات\n.ايموجيات\n.طائره\n.شرطه\n.النضام الشمسي\n.عين\n.ثعبان\n.رجل\n.مايكرو\n.رموزشيطانيه\n.قطار\n.موسيقى\n.رسم\n.تحميلات\n.اشكال مربع\n.دائره\n.قلب\n.مزاج\n.قرد\n.يد\n.العد التنازلي\n.الوان قلوب\n.غبي\n.تفجير\n.قتل\n.شنو\n.طوبه\n.مربعات\n.حلويات\n.نار\n\n• ⚜️ |  اوامر تغير حساب شخصي :  \n\n.وضع بايو\n.وضع اسم\n.وضع صورة\n.وضع معرف\n.الحساب\n.حذف صوره\n.انشائي\n\n• ⚜️ |  اوامر تكرار رسائل : وتليجراف\n\n.تكرار\n.تكرار الملصق\n.تكرار بالحرف\n.تكرار بالكلمه\n.مؤقت\n.تليجراف ( ميديا او كتابه )\n\n• ⚜️ |  اوامر تحميل من مواقع تواصل :   \n\n.تحميل ص\n.تحميل ف\n.نتائج بحث + اسم الاغنيه\n.انستا\.بحث + اسم الاغنيه\n.بحث فيديو\n.معلومات الاغنيه \n\n• ⚜️ |  اعاده التشغيل والاطفاء :  \n\n.اعاده تشغيل\n.اطفاء تليثون\n.اطفاء مؤقت +الوقت\n.التحديثات \n\n• ⚜️ | اوامر الخاصة بلمجموعه :\n\n.المشرفين\n.البوتات\n.الأعضاء\n.معلومات\n.موقع \n\n• ⚜️ |  اوامر رساله الحماية الخاص :   \n\n.الحماية تشغيل\n.الحماية ايقاف \n.قبول - رفض ( للحماية) \n .مرفوض ( حظر من الخاص)\n.المقبولين ( عرض قائمة المقبولين في الحماية ) \n\n• ⚜️ |  اوامر كورونا والصنع والوقت  : \n\n.الاذان\n.كورونا + اسم الدوله بالانكليزي\n.ايدي + رد على الشخص\n.صنع مجموعه خارقه او قناه + الاسم\n.الوقت - لضهور تاريخ والوقت\n.وقتي - لضهور تاريخ والوقت بملصق \n\n• ⚜️ |  اوامر مسح وتنظيف رسائل   : \n\n.تنظيف + الرد على الرساله ينضف مافي تحتها\n.حذف + رد على رساله يمسح الرساله\n.تنظيف رسائلي + عدد\n\n• ⚜️ |  اوامر البروفايل الوقتي :   \n\n.اسم وقتي\n.نبذه وقتيه\n.صوره وقتيه\n.ايقاف اسم وقتي\n.ايقاف نبذه وقتيه\n.ايقاف صوره وقتيه",
    )
@iqthon.iq_cmd(
    pattern="م1$",
    command=("م1", plugin_category),
    info={
        "header": "م1",
        "usage": "م1",
    },
)
async def _(event):
    "م1"
    await edit_or_reply(
        event,
        "**• ⚜️ |  اوامر الادمن والمجموعه :**  \n `.مسح جميع الردود` \n `.مسح رد` \n `.جميع الردود`\n`.اضف رد`\n`.صورة`\n`.رفع مشرف`\n`.تك`\n`.طرد`\n`.تثبيت`\n`.الغاء التثبيت`\n`.الاحداث`\n`.حظر`\n`.الغاء حظر`\n`.كتم`\n`.الغاء كتم`\n`.الاوامر`\n`.جميع الاوامر`\n`.الايدي`\n`.بنك`\n`.ترحيب`\n`.مسح الترحيبات`\n`.الترحيبات`\n`.رساله الترحيب السابقه`\n`.السورس`\n`.انتحال`\n`.الغاء الانتحال`",
    )
@iqthon.iq_cmd(
    pattern="م2$",
    command=("م2", plugin_category),
    info={
        "header": "م2",
        "usage": "م2",
    },
)
async def _(event):
    "م2"
    await edit_or_reply(
        event,
        "**• ⚜️ |  اوامر متحركات تسلية :** \n.بوسه\n.زرفه\n.بيبي\n.افكر\n.ضحك\n.ضايج\n.وقت\n.قلوب\n.رياضه\n.الارض\n.قمر\n.اقمار\n.قمور\n.فراشه\n.مكعبات\n.مطر\n.تحركات\n.ايموجيات\n.طائره\n.شرطه\n.النضام الشمسي\n.عين\n.ثعبان\n.رجل\n.مايكرو\n.رموزشيطانيه\n.قطار\n.موسيقى\n.رسم\n.تحميلات\n.اشكال مربع\n.دائره\n.قلب\n.مزاج\n.قرد\n.يد\n.العد التنازلي\n.الوان قلوب\n.غبي\n.تفجير\n.قتل\n.شنو\n.طوبه\n.مربعات\n.حلويات\n.نار",
    )
@iqthon.iq_cmd(
    pattern="م3$",
    command=("م3", plugin_category),
    info={
        "header": "م3",
        "usage": "م3",
    },
)
async def _(event):
    "م3"
    await edit_or_reply(
        event,
        "**• ⚜️ | اوامر تغير حساب شخصي :** \n`.وضع بايو`\n`.وضع اسم`\n`.وضع صورة`\n`.وضع معرف`\n`.الحساب`\n`.حذف صوره`\n`.انشائي`",
    )
@iqthon.iq_cmd(
    pattern="م4$",
    command=("م4", plugin_category),
    info={
        "header": "م4",
        "usage": "م4",
    },
)
async def _(event):
    "م4"
    await edit_or_reply(
        event,
        "**• ⚜️ |  اوامر تكرار رسائل : وتليجراف**\n`.تكرار`\n`.تكرار الملصق`\n`.تكرار بالحرف`\n`.تكرار بالكلمه`\n`.مؤقت`\n`.تليجراف ميديا `n\`.تليجراف كتابه `\n",
    )           
@iqthon.iq_cmd(
    pattern="م5$",
    command=("م5", plugin_category),
    info={
        "header": "م5",
        "usage": "م5",
    },
)
async def _(event):
    "م5"
    await edit_or_reply(
        event,
        "• ⚜️ | ** اوامر تحميل من مواقع تواصل :**   \n`.تحميل ص `\n`.تحميل ف `\n`.نتائج بحث + اسم الاغنيه `\n`.انستا `\n`.بحث + اسم الاغنيه`\n`.بحث فيديو `\n`.معلومات الاغنيه `\n",
    )
@iqthon.iq_cmd(
    pattern="م6$",
    command=("م6", plugin_category),
    info={
        "header": "م6",
        "usage": "م6",
    },
)
async def _(event):
    "م6"
    await edit_or_reply(
        event,
        "**• ⚜️ |  اعاده التشغيل والاطفاء :**  \n`.اعاده تشغيل`\n`.اطفاء تليثون`\n`.اطفاء مؤقت +الوقت`\n`.التحديثات تشغيل`\n`.التحديثات ايقاف`",
    ) 
@iqthon.iq_cmd(
    pattern="م7$",
    command=("م7", plugin_category),
    info={
        "header": "م7",
        "usage": "م7",
    },
)
async def _(event):
    "م7"
    await edit_or_reply(
        event,
        "**• ⚜️ | اوامر الخاصة بلمجموعه :** \n`.المشرفين`\n`.البوتات`\n`.الأعضاء`\n`.معلومات`\n`.موقع`",
    )
@iqthon.iq_cmd(
    pattern="م8$",
    command=("م8", plugin_category),
    info={
        "header": "م8",
        "usage": "م8",
    },
)
async def _(event):
    "م8"
    await edit_or_reply(
        event,
        "**• ⚜️ |  اوامر رساله الحماية الخاص :**  \n`.الحماية تشغيل`\n`.الحماية ايقاف` \n`.قبول - رفض ( للحماية) `\n `.مرفوض ( حظر من الخاص)`\n`.المقبولين ( عرض قائمة المقبولين في الحماية ) `",
    ) 
@iqthon.iq_cmd(
    pattern="م9$",
    command=("م9", plugin_category),
    info={
        "header": "م9",
        "usage": "م9",
    },
)
async def _(event):
    "م9"
    await edit_or_reply(
        event,
        "**• ⚜️ |  اوامر كورونا والصنع والوقت  :** \n`.الاذان`\n`.كورونا + اسم الدوله بالانكليزي`\n`.ايدي + رد على الشخص`\n`.صنع مجموعه خارقه او قناه + الاسم`\n`.الوقت - لضهور تاريخ والوقت`\n`.وقتي - لضهور تاريخ والوقت بملصق `",
    )
@iqthon.iq_cmd(
    pattern="م10$",
    command=("م10", plugin_category),
    info={
        "header": "م10",
        "usage": "م10",
    },
)
async def _(event):
    "م10"
    await edit_or_reply(
        event,
        "**• ⚜️ |  اوامر مسح وتنظيف رسائل :** \n`.تنظيف + الرد على الرساله ينضف مافي تحتها`\n`.حذف + رد على رساله يمسح الرساله`\n`.تنظيف رسائلي + عدد`\n",
    )
@iqthon.iq_cmd(
    pattern="م11$",
    command=("م11", plugin_category),
    info={
        "header": "م11",
        "usage": "م11",
    },
)
async def _(event):
    "م11"
    await edit_or_reply(
        event,
        "**• ⚜️ |  اوامر البروفايل الوقتي :** \n`.اسم وقتي`\n`.نبذه وقتيه`\n`.صوره وقتيه`\n`.ايقاف اسم وقتي`\n`.ايقاف نبذه وقتيه`\n`.ايقاف صوره وقتيه`",
    ) 
@iqthon.iq_cmd(
    pattern="م12$",
    command=("م12", plugin_category),
    info={
        "header": "م12",
        "usage": "م12",
    },
)
async def _(event):
    "م12"
    await edit_or_reply(
        event,
        "**•  ⚜️ |  اوامـر الازعـاج والترجـمـة والمنـع  :**  \n `.ازعاج `\n `.الغاء الازعاج` \n `.مسح الازعاج`\n`.المزعجهم`\n •••••••••••••••••••••••••••••• \n `.ترجمه ar` ( من نكليزي الى عربي )\n `.ترجمه en` ( من عربي الى نكليزي ) \n `.تكلم en`  ( ترجمه صوتيه تحويل من عربي الى الانكلش )\n`.تكلم ar` ( ترجمه صوتيه تحويل من نكلش الى عربي ) \n •••••••••••••••••••••••••••••• \n `.المنع تشغيل` \n `.المنع ايقاف` -  ( لأيقاف وتشغيل مسح كلمات الممنوعه)\n`.منع +  الكلمة او الرد على الكلمة`\n `.الغاء منع + كلمة او الرد على الكلمة` \n `.قائمة المنع ( لأضهار جميع الكلمات الممنوعه)`",
    )      
